yii/frontend/controllers/LianxiController.php

    public function actionIndex()
    {
        $cookie = Yii::$app->request->cookies;

        if(isset($cookie['id'])){
            $id = $cookie['id'];
            $model = new Zhuce();
            $data=$model->find()->where(['id'=>$id])->asArray()->One();
---
SELECT * FROM `zhuce` WHERE `id`=:qp0

   	public function actionAdd_do1()
    {
        $cookie = Yii::$app->request->cookies;
        if(isset($cookie['id']))
        {
          $id = $cookie['id'];
          $sjh = Yii::$app->request->post('sjh');
          $password = Yii::$app->request->post('password');
          $qrpassword = Yii::$app->request->post('qrpassword');
          if($password != $qrpassword)
          {
            echo "<script>alert('两项密码不相同');location.href='index.php?r=site/index'</script>";
          }
          $model = Zhuce::findOne($id);
---
SELECT * FROM `zhuce` WHERE `id`=:qp0

    public function actionAdd_2()
    {
      $cookie = Yii::$app->request->cookies;
      if(isset($cookie['id'])){
            $id = $cookie['id'];
            $model = new Zhuce();
            $data=$model->find()->where(['id'=>$id])->asArray()->One();
---
SELECT * FROM `zhuce` WHERE `id` IS NULL

    public function actionAdd_do2()
    {
        $cookie = Yii::$app->request->cookies;
        $id = $cookie['id'];
        $username = Yii::$app->request->post('username');
        $sr = Yii::$app->request->post('sr');
        $dz = Yii::$app->request->post('dz');
        $db = Zhuce::findOne($id);
        $db->username = $username;
        $db->sr = $sr;
        $db->dz = $dz;
        $res = $db->save();
---
SELECT * FROM `zhuce` WHERE `id`=:qp0
UPDATE `zhuce` SET `username`='heheh', `sr`='123', `dz`='123' WHERE `id`=17