yiiceshi/basic/controllers/TestoneController.php

	public function actionAdd(){
		$data = Yii::$app->request->post();
		if($data){
				if($data['is_need'] == 1){
			if($data['fi_name'] == ''){
			echo '名称必填，因为你选择了必填';die;
			}
			if($data['fi_val'] == ''){
				echo '字段必填,因为你选择了必填';die;
			}
			if($data['fi_option_one'] == ''){
				echo '字段选择必填，因为你选择了必填，不服可以回去取消';die;
			}
		}
		}

		$model = new Field();
		if ($post=Yii::$app->request->post()) {
			$id=Yii::$app->request->post('ssid');

			if ($id){
				// print_r($id);die;
				// $post=Yii::$app->request->post("Field");
				// print_r($post);die;
				$model = Field::find()->where("id='$id'")->One();
---
SELECT * FROM `field` WHERE `id`='4'

	public function actionIndex(){
		$model = new Field();
		$data = $model->find()->asArray()->all();
---
SELECT * FROM `field`